[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:5:70
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function HelpRequestForm({initialContents, submitAction, buttonLabel="Create"}) {
+function HelpRequestForm({initialContents, submitAction, buttonLabel=""}) {
     
     // Stryker disable all
killedBy: HelpRequestForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:57:30
                             {...register("requesterEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && 'Requester Email is required'}
+                            {true}
                             {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be in the format username@domain, e.g. cgaucho@ucsb.edu'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:57:30
                             {...register("requesterEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && 'Requester Email is required'}
+                            {false}
                             {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be in the format username@domain, e.g. cgaucho@ucsb.edu'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requester Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:58:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required'}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be in the format username@domain, e.g. cgaucho@ucsb.edu'}
+                            {errors.requesterEmail?.type !== 'pattern' && 'Requester Email must be in the format username@domain, e.g. cgaucho@ucsb.edu'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Requester Email/

Here are the matching elements:

<label
  class="form-label"
  for="requesterEmail"
>

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:58:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required'}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be in the format username@domain, e.g. cgaucho@ucsb.edu'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Requester Email must be in the format username@domain, e.g. cgaucho@ucsb.edu/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] BooleanLiteral
main/components/HelpRequest/HelpRequestForm.js:72:43
                             type="text"
                             isInvalid={Boolean(errors.teamId)}
                             {...register("teamId", {
-                                required: true
+                                required: false
                             })}
                         />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:76:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamId && "Team ID is required"}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:76:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamId && "Team ID is required"}
+                            {errors.teamId || "Team ID is required"}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Team ID/

Here are the matching elements:

<label
  class="form-label"
  for="teamId"
>

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:89:65
                             id="tableOrBreakoutRoom"
                             type="text"
                             isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-                            {...register("tableOrBreakoutRoom", { required: true })}
+                            {...register("tableOrBreakoutRoom", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room Required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:92:30
                             {...register("tableOrBreakoutRoom", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.tableOrBreakoutRoom && "Table or Breakout Room Required"}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room Required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:92:30
                             {...register("tableOrBreakoutRoom", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.tableOrBreakoutRoom && "Table or Breakout Room Required"}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table or Breakout Room Required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:108:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'Request Time is required'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:108:30
                             {...register("requestTime", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestTime && 'Request Time is required'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:124:30
                             {...register("explanation", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.explanation && 'Explanation is required'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.js:124:30
                             {...register("explanation", { required: true })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.explanation && 'Explanation is required'}
+                            {errors.explanation || 'Explanation is required'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Explanation/

Here are the matching elements:

<label
  class="form-label"
  for="explanation"
>
