[Survived] Regex
main/components/MenuItemReview/MenuItemReviewForm.js:27:23
     // Stryker disable next-line Regex
     const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
 
-    const num_regex = /^\d+$/;
+    const num_regex = /^\d+/;
 
     return (

[Survived] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:60:46
                                 id="itemID"
                                 type="text"
                                 isInvalid={Boolean(errors.itemID)}
-                                {...register("itemID", {
+                                {...register("", {
                                     required: "itemID is required.",
                                     pattern: num_regex

[Survived] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:60:56
                                 id="itemID"
                                 type="text"
                                 isInvalid={Boolean(errors.itemID)}
-                                {...register("itemID", {
-                                    required: "itemID is required.",
-                                    pattern: num_regex
-                                })}
+                                {...register("itemID", {})}
                             />
                             <Form.Control.Feedback type="invalid">

[Survived] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:66:30
                                 })}
                             />
                             <Form.Control.Feedback type="invalid">
-                            {errors.itemID?.message}
+                            {errors.itemID.message}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:102:62
                                 {...register("stars", {
                                     required: "Stars are required.",
                                     pattern: num_regex,
-                                    min: {value: 0, message: "Minimum rating is 0 stars"},
+                                    min: {value: 0, message: ""},
                                     max: {value: 5, message: "Maximum rating is 5 stars"}
                                 })}
