[Survived] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:9:31
 
 export default function MenuItemReviewCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (review) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-     itemID: review.itemID,
-     reviewerEmail: review.reviewerEmail,
-     stars: review.stars,
-     comments: review.comments,
-     dateReviewed: review.dateReviewed
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (review) => {

[Survived] ObjectLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:12:13
   const objectToAxiosParams = (review) => ({
     url: "/api/menuitemreview/post",
     method: "POST",
-    params: {
-     itemID: review.itemID,
-     reviewerEmail: review.reviewerEmail,
-     stars: review.stars,
-     comments: review.comments,
-     dateReviewed: review.dateReviewed
-    }
+    params: {}
   });
 

[Survived] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:21:33
     }
   });
 
-  const onSuccess = (review) => {
-    toast(`New Menu Item Review Created - id: ${review.id} Reviewer Email: ${review.reviewerEmail}`);
-  }
+  const onSuccess = (review) => {}
 
   const mutation = useBackendMutation(

[Survived] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:22:11
   });
 
   const onSuccess = (review) => {
-    toast(`New Menu Item Review Created - id: ${review.id} Reviewer Email: ${review.reviewerEmail}`);
+    toast(``);
   }
 
