[Survived] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (review) => ({
-        url: "/api/menuitemreview",
-        method: "PUT",
-        params: {
-            id: review.id,
-        },
-        data: {
-            itemID: review.itemID,
-            reviewerEmail: review.reviewerEmail,
-            comments: review.comments,
-            stars: review.stars,
-            dateReviewed: review.dateReviewed
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (review) => {

[Survived] BlockStatement
main/pages/MenuItemReview/MenuItemReviewEditPage.js:39:35
         }
     });
 
-    const onSuccess = (review) => {
-        toast(`Menu Item Review Updated - id: ${review.id} Reviewer Email: ${review.reviewerEmail}`);
-    }
+    const onSuccess = (review) => {}
 
     const mutation = useBackendMutation(

[Survived] StringLiteral
main/pages/MenuItemReview/MenuItemReviewEditPage.js:40:15
     });
 
     const onSuccess = (review) => {
-        toast(`Menu Item Review Updated - id: ${review.id} Reviewer Email: ${review.reviewerEmail}`);
+        toast(``);
     }
 

[Survived] LogicalOperator
main/pages/MenuItemReview/MenuItemReviewEditPage.js:65:21
             <div className="pt-2">
                 <h1>Edit Menu Item Review</h1>
                 {
-                    review && <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={review} />
+                    review || <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={review} />
                 }
             </div>

[Survived] ConditionalExpression
main/pages/MenuItemReview/MenuItemReviewEditPage.js:65:21
             <div className="pt-2">
                 <h1>Edit Menu Item Review</h1>
                 {
-                    review && <MenuItemReviewForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={review} />
+                    true
                 }
             </div>
