[Survived] BlockStatement
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:13:30
 
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/menuitemreview/create"
-                style={{ float: "right" }}
-            >
-                Create Menu Item Review
-            </Button>
-        )
-    } 
-  }
+  const createButton = () => {}
   
   const { data: reviews, error: _error, status: _status } =

[Survived] BlockStatement
main/pages/MenuItemReview/MenuItemReviewIndexPage.js:14:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        return (
-            <Button
-                variant="primary"
-                href="/menuitemreview/create"
-                style={{ float: "right" }}
-            >
-                Create Menu Item Review
-            </Button>
-        )
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
   }
   
