[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:46:42
                     id="name"
                     type="text"
                     isInvalid={Boolean(errors.name)}
-                    {...register("name", {
-                        required: "Name is required.",
-                        maxLength : {
-                            value: 255,
-                            message: "Max length 255 characters"
-                        }
-                    })}
+                    {...register("name", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:70:38
                         required: "Dining Commons Code is required.",
                         maxLength : {
                             value: 255,
-                            message: "Max length 255 characters"
+                            message: ""
                         }
                     })}
killedBy: UCSBDiningCommonsMenuItemsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:86:45
                     id="station"
                     type="text"
                     isInvalid={Boolean(errors.station)}
-                    {...register("station", {
-                        required: "Station is required.",
-                        maxLength : {
-                            value: 255,
-                            message: "Max length 255 characters"
-                        }
-                    })}
+                    {...register("station", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Station is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:88:37
                     isInvalid={Boolean(errors.station)}
                     {...register("station", {
                         required: "Station is required.",
-                        maxLength : {
-                            value: 255,
-                            message: "Max length 255 characters"
-                        }
+                        maxLength : {}
                     })}
                 />
killedBy: UCSBDiningCommonsMenuItemsForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Max length 255 characters/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
