[Survived] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:40:53
                             id="orgCode"
                             type="text"
                             isInvalid={Boolean(errors.orgCode)}
-                            {...register("orgCode", { 
-                                required: "OrgCode is required.",
-                                maxLength: {
-                                    value: 10,
-                                    message: "Max length 10 characters"
-                                }
-                            })}
+                            {...register("orgCode", {})}
                             disabled={initialContents}
                         />

[Survived] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:42:44
                             isInvalid={Boolean(errors.orgCode)}
                             {...register("orgCode", { 
                                 required: "OrgCode is required.",
-                                maxLength: {
-                                    value: 10,
-                                    message: "Max length 10 characters"
-                                }
+                                maxLength: {}
                             })}
                             disabled={initialContents}
