[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:18:18
     const navigate = useNavigate();
 
     const editCallback = (cell) => {
-        navigate(`/ucsborganization/edit/${cell.row.values.orgCode}`)
+        navigate(``)
     }
 
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsborganization/edit/SKY"
Received: ""

Number of calls: 1

<html>
