[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:56:72
                             id="requestorEmail"
                             type="text"
                             isInvalid={Boolean(errors.requestorEmail)}
-                            {...register("requestorEmail", { required: true})}
+                            {...register("requestorEmail", { required: false})}
 
                             
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requestor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:56:60
                             id="requestorEmail"
                             type="text"
                             isInvalid={Boolean(errors.requestorEmail)}
-                            {...register("requestorEmail", { required: true})}
+                            {...register("requestorEmail", {})}
 
                             
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requestor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:61:30
                             
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestorEmail && "Requestor Email is required."}
+                            {errors.requestorEmail || "Requestor Email is required."}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Requestor Email/

Here are the matching elements:

<label
  class="form-label"
  for="requestorEmail"
>

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:61:30
                             
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requestorEmail && "Requestor Email is required."}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Requestor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:73:60
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", { required: true})}
+                            {...register("professorEmail", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:135:46
                                 type="checkbox"
                                 isInvalid={Boolean(errors.done)}
                                 
-                                {...register("done", { 
+                                {...register("", { 
                                 //    required: "Done is required."
                                 })}
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
