[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:35:9
             Header: 'id',
             accessor: 'id', // accessor is the "key" in the data
         },
-        {
-            Header: 'Requestor Email',
-            accessor: 'requestorEmail',
-        },
+        {},
         {
             Header: 'Professor Email',
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestTable.js:36:21
             accessor: 'id', // accessor is the "key" in the data
         },
         {
-            Header: 'Requestor Email',
+            Header: "",
             accessor: 'requestorEmail',
         },
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Requestor Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
