[Survived] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:56:9
             Header: 'DateNeeded',
             accessor: 'dateNeeded',
         },
-        {
-            Header: 'Done',
-            accessor: 'done',
-        }
+        {}
     ];
 

[Survived] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:63:43
     ];
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestsTable"));
+        columns.push(ButtonColumn("Edit", "", editCallback, "RecommendationRequestsTable"));
         columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestsTable"));
     } 

[Survived] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:64:71
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestsTable"));
+        columns.push(ButtonColumn("Delete", "danger", deleteCallback, ""));
     } 
 
